import os
import platform
from getpass import getpass
import time
import pyautogui
import requests
import base64
from ast import literal_eval

def clear():
    if platform.system() == 'Windows':
        os.system("cls")
    else:
        os.system("clear")

def connect(id, pw):
    url = 'http://vpn.internal.dyhs.kr/signin'

    request = {
        'id': id,
        'password': pw
    }

    response = requests.post(url, json=request)
    response_data = response.json()

    if response_data['message'] != 'Success':
        print("오류가 발생했습니다.")
        clear()
        print('비밀번호 변경이 실패하였습니다.')
        print(f"에러 메시지: {response_data['message']}")
        pause = input("엔터를 입력하시면 메인페이지로 이동합니다.")

        if pause != None:
            main()

    peer = response_data['peer']
    decode_peer = base64.b64decode(peer)
    peer = decode_peer.decode('utf-8')

    peer = literal_eval(peer)
    p_private_key = peer['privateKey']
    p_address = peer['address']
    p_public_key = peer['publicKey']
    p_preshared_key = peer['presharedKey']
    p_endpoint = peer['endpoint']
    p_allowed_ip = peer['allowedIPs']
    p_dns = peer['dns']

    if platform.system() == 'Linux':
        print("WireGuard 실행을 위해 관리자 권한(sudo 권한)이 필요합니다.")
        time.sleep(1)
        shell_pw = getpass("컴퓨터의 패스워드를 입력하세요(입력 시 보이지 않음): ")
        print("# 연결이 곧 시작됩니다. 더이상 프로그램을 조작하지 마세요.")
        time.sleep(3)

        with open(f"DY-NET_{id}.conf", "w") as f:
            f.write("\n")
            f.write("[Interface]\n")
            f.write(f"PrivateKey = {p_private_key}\n")
            f.write(f"Address = {p_address}\n")
            f.write(f"DNS = {p_dns}\n")
            f.write("\n")
            f.write("[Peer]\n")
            f.write(f"PublicKey = {p_public_key}\n")
            f.write(f"PresharedKey = {p_preshared_key}\n")
            f.write(f"AllowedIPs = {p_allowed_ip}\n")
            f.write(f"Endpoint = {p_endpoint}")
        os.system(f"sudo wg-quick up {os.getcwd()}/DY-NET_{id}.conf")
        pyautogui.typewrite(f"{shell_pw}\n", interval=0.01)
        time.sleep(3)
        clear()

    else:
        with open(f"peer/DY-NET_{id}.conf", "w") as f:
            f.write("\n")
            f.write("[Interface]\n")
            f.write(f"PrivateKey = {p_private_key}\n")
            f.write(f"Address = {p_address}\n")
            f.write(f"DNS = {p_dns}\n")
            f.write("\n")
            f.write("[Peer]\n")
            f.write(f"PublicKey = {p_public_key}\n")
            f.write(f"PresharedKey = {p_preshared_key}\n")
            f.write(f"AllowedIPs = {p_allowed_ip}\n")
            f.write(f"Endpoint = {p_endpoint}")
        clear()
        print("VPN 접속 피어가 '작업경로/peer' 폴더에 저장되었습니다.")
        time.sleep(1)
        print("접속 방법은 프로그램의 '도움말'을 참고해 주세요.")
        time.sleep(1)

    print("모든 동작이 완료되었습니다. 프로그램을 종료합니다.")
    time.sleep(3)
    exit()

def disconnect(id):
    clear()
    print("WireGuard 실행을 위해 관리자 권한(sudo 권한)이 필요합니다.")
    time.sleep(1)
    shell_pw = getpass("컴퓨터의 패스워드를 입력하세요(입력 시 보이지 않음): ")
    os.system(f"sudo wg-quick down {os.getcwd()}/DY-NET_{id}.conf")
    pyautogui.typewrite(f"{shell_pw}\n", interval=0.01)
    time.sleep(2)
    os.system(f"sudo rm DY-NET_{id}.conf")
    clear()
    print("모든 동작이 완료되었습니다. 프로그램을 종료합니다.")
    time.sleep(2)
    exit()

def change_password(id, pw, change_pw):
    url = 'http://vpn.internal.dyhs.kr/password-change'
    request = {
        'id': id,
        'password': pw,
        'newPassword': change_pw
    }
    response = requests.post(url, json=request)
    response_data = response.json()
    message = response_data['message']
    if message == 'Success':
        clear()
        print("비밀번호 변경이 완료되었습니다. 2초 뒤 메인 페이지로 이동합니다.")
        time.sleep(2)
        main()
    else:
        clear()
        print('비밀번호 변경이 실패하였습니다.')
        print(f"에러 메시지: {message}")
        pause = input("엔터를 입력하시면 메인페이지로 이동합니다.")
        if pause != None:
            main()

def main():
    clear()
    print("                                           ....,,-------,....                                       \n                                      .,----------------------,.                                    \n                                   .,----------------------------,.                                 \n                                 ------------------------------------                               \n                              .,--------------------------------------,.                            \n                            .--------------------------------------------.                          \n                          .------------------------------------------------.                        \n                         ,--------------------------------------------------,                       \n                       ,------------------------------------------------------,                     \n                      ,--------------------------------------------------------,                    \n                     ------------------------------------------------------------                   \n                   .--------------------------------------------------------------.                 \n                  .----------------------------------------------------------------.                \n                 ,------------------------------------------------------------------,               \n                ,-------------------------,,,      ----------------------------------,              \n               ,------------------------.          --------. .------------------------,             \n              .----------------------,             --------.    ,----------------------.            \n             .---------------------.               --------.      .---------------------.           \n            .--------------------.                 --------.        .--------------------.          \n            --------------------                   --------.          --------------------          \n           ,------------------.                    --------.           .------------------,         \n          .------------------.                     --------.            .------------------.        \n          ------------------                       --------.              ------------------        \n         ,----------------,                        --------.               ,----------------,       \n        .-----------------                         --------.                -----------------.      \n        ,---------------,                          --------.                 ,---------------,      \n        ----------------                           --------.                  ----------------.     \n       ----------------.                           --------.                  .----------------     \n      .---------------,                            --------.                   ,---------------.    \n      ,---------------                       .,,,----------.                    ---------------,    \n      ---------------                      ,---------------.                     ---------------    \n     ,--------------,                    ,-----------------.                     ,--------------,   \n     ---------------                    -------------------.                      ---------------   \n    .--------------.                  .--------------------.                      .--------------.  \n    .--------------                  ,---------------------.                       --------------.  \n    ---------------                 .----------------------.                       ---------------  \n    --------------.                .-----------------------.                       .--------------  \n   .--------------                 --------------,,,,,,,,,.                         --------------. \n   ,-------------,                ,-----------.                                     ,-------------, \n   --------------.               .----------,                                       .-------------- \n   --------------                ,---------.                                         -------------- \n   --------------                ---------,                                          -------------- \n  .--------------               ,---------                                           --------------.\n  .-------------,               ,--------.                                           ,-------------.\n  .-------------.               --------,                                            .-------------.\n  ,-------------                --------,                                             -------------,\n  ,-------------                --------.                                             -------------,\n  ,-------------                --------                          ...........         -------------,\n  ,-------------                --------                         -----------          -------------,\n  ,-------------                --------.                       ,----------.          -------------,\n  ,-------------                --------,                      ,----------,           -------------,\n  ,-------------                --------,                     .----------,            -------------,\n  .-------------.               ---------                    .----------,            .-------------.\n  .-------------,               ,--------.                   -----------             ,-------------.\n  .--------------               .---------.                 ,----------              --------------.\n   --------------                ----------                ,----------.              -------------- \n   --------------                .----------              ,----------,               -------------- \n   --------------.                -----------.          .,----------,               .-------------- \n   ,-------------,                .------------,      .-------------                ,-------------, \n   .--------------                 ,-------------------------------                 --------------. \n    --------------.                 ------------------------------.                .--------------  \n    --------------,                  ----------------------------.                 ,--------------  \n    .--------------                   --------------------------.                  --------------.  \n    .--------------.                   ,-----------------------,                  .--------------.  \n     ---------------                    ,---------------------,                   ---------------   \n     ,--------------,                     ,-------------------                   ,--------------,   \n      ---------------                       ,,---------------                    ---------------    \n      ,---------------                          .-----------.                   ---------------,    \n      .---------------,                         ,----------,                   ,---------------.    \n       ----------------                         ----------,                    ----------------     \n       .----------------                      .----------,                    ----------------.     \n        ,---------------,                     -----------                    ,---------------,      \n        .----------------,                   -----------                    ,----------------.      \n         ,----------------,                 ,----------.                   ,----------------,       \n          ------------------               ,----------.                   ------------------        \n          .------------------.            .----------,                  .------------------.        \n           ,------------------.           -----------                  .------------------,         \n            -------------------,         -----------                  ,-------------------          \n             --------------------.      -----------.                .--------------------           \n             .---------------------.   ,----------.               .---------------------.           \n              ,----------------------..----------,              .----------------------,            \n               ,--------------------------------,            .,-----------------------,             \n                ,-------------------------------        ...--------------------------,              \n                 ,------------------------------------------------------------------,               \n                  ,----------------------------------------------------------------,                \n                   ,--------------------------------------------------------------,                 \n                    .------------------------------------------------------------.                  \n                      ----------------------------------------------------------                    \n                       .------------------------------------------------------.                     \n                         ,--------------------------------------------------,                       \n                          .------------------------------------------------.                        \n                            .--------------------------------------------.                          \n                              .----------------------------------------.                            \n                                .,----------------------------------,.                              \n                                   .------------------------------.                                 \n                                      ..,--------------------,..                                    \n                                           .,--,,,,,,,,--,.                                         \n                                                                                                    \n                                                                                                    \n        *@@@@@@@@@@~  ~@@@   ,@@@.                   ,@@@*    -@@@  $@@@@@@@@@@@ ;@@@@@@@@@@@*      \n        *@@@@@@@@@@#   #@@:  *@@!                    ,@@@@,   -@@@  $@@@@@@@@@@@ ;@@@@@@@@@@@*      \n        *@@*    *@@@   ;@@$ .@@@.                    ,@@@@#   -@@@  $@@:              @@@           \n        *@@*     $@@-   @@@~*@@=                     ,@@@@@-  -@@@  $@@:              @@@           \n        *@@*     =@@-   ;@@@#@@,                     ,@@@@@$  -@@@  $@@:              @@@           \n        *@@*     =@@-   .@@@@@*      ----------      ,@@@!@@~ -@@@  $@@:              @@@           \n        *@@*     =@@-    *@@@@,      @@@@@@@@@@      ,@@@-@@# -@@@  $@@@########      @@@           \n        *@@*     =@@-     @@@$       @@@@@@@@@@      ,@@@ $@@--@@@  $@@@@@@@@@@@      @@@           \n        *@@*     =@@-     *@@:       ~~~~~~~~~~      ,@@@ .@@#-@@@  $@@@@@@@@@@@      @@@           \n        *@@*     =@@-     !@@~                       ,@@@  *@@$@@@  $@@:              @@@           \n        *@@*     =@@-     !@@~                       ,@@@  .@@@@@@  $@@:              @@@           \n        *@@*     $@@-     !@@~                       ,@@@   !@@@@@  $@@:              @@@           \n        *@@*    !@@@      !@@~                       ,@@@   .#@@@@  $@@:              @@@           \n        *@@@@@@@@@@#      !@@~                       ,@@@    !@@@@  $@@#$$$$$$$$      @@@           \n        *@@@@@@@@@@-      !@@~                       ,@@@     @@@@  $@@@@@@@@@@@      @@@           \n        *@@@@@@@@$~       !@@~                       ,@@@     :@@@  $@@@@@@@@@@@      @@@           \n")
    print(" ------------------------------------------{{DY - NET}}---------------------------------------------")
    print("|                                          1. 도움말                                                |")
    print("|                                          2. 외부망 연결                                           |")
    print("|                                          3. 연결 해제 (리눅스 전용)                               |")
    print("|                                          4. 비밀번호 변경                                         |")
    print("|                                          5. 나가기                                                |")
    print(" ---------------------------------------------------------------------------------------------------")
    choice = input("번호를 입력하세요: ")

    if choice == '1':
        clear()
        print("[--------------------------{{도움말 페이지}}--------------------------]")
        print("# 위 프로그램은 덕영고등학교 학생용 가상사설망(VPN) 클라이언트 입니다.")
        print("# 프로그램을 사용하기 위해서 관리자에게 계정생성을 요청해야 합니다.")
        print("# 자세한 사항은 아래 링크를 참고 부탁드립니다.")
        print("# https://zerocoke.gitbook.io/dy-net/")
        pause = input("엔터를 입력하시면 메인페이지으로 이동합니다.")
        
        if pause != None:
            main()
    
    elif choice == '2':
        clear()
        print("[---------------{{외부망 접속 페이지}}--------------]")
        print("VPN 서비스에 첫 로그인입니까?")
        first_login = input("y/N: ")

        if first_login == 'y':
            clear()
            print("비밀번호 변경이 필요합니다. 비밀번호 변경을 시작합니다.")
            time.sleep(1)
            id = input("아이디를 입력해주세요: ")
            pw = getpass("비밀번호를 입력해주세요(입력 시 보이지 않음): ")
            change_pw = getpass("변경 할 비밀번호를 입력해주세요(입력 시 보이지 않음): ")

            change_password(id, pw, change_pw)
        
        else: 
            clear()
            print("[---------------{{외부망 접속 페이지}}--------------]")
            id = input("아이디를 입력해주세요: ")
            pw = getpass("비밀번호를 입력해주세요(입력 시 보이지 않음): ")

            connect(id, pw)
    
    elif choice == '3':
        clear()
        print("[---------------{{연결 해제 페이지}}--------------]")

        if platform.system() == 'Linux':
            id = input("아이디를 입력해주세요: ")
            disconnect(id)

        else:
            print("현재 운영체제에선 지원하지 않는 기능입니다.")
            pause = input("엔터를 입력하시면 메인페이지로 이동합니다.")

            if pause != None:
                main()

    elif choice == '4':
        clear()
        print("[---------------{{비밀번호 변경 페이지}}--------------]")
        id = input("아이디를 입력해주세요: ")
        pw = getpass("비밀번호를 입력해주세요(입력 시 보이지 않음): ")
        change_pw = getpass("비밀번호를 입력해주세요(입력 시 보이지 않음): ")
        
        change_password(id, pw, change_pw)
    
    elif choice == '5':
        clear()
        print("프로그램을 종료하시겠습니까?")
        choice = input("y/N: ")
        
        if choice != 'y':
            clear()
            print("메인페이지로 이동합니다.")
            time.sleep(1)
            main()
        else:
            clear()
            print("프로그램을 종료합니다.")
            time.sleep(1)
            exit()
    
    else:
        print("올바른 번호를 입력하십시오")
        time.sleep(1)
        main()

if __name__ == '__main__':
    main()